In [1]:
import numpy as np
import pandas as pd
pd. __version__

'1.5.0'

In [2]:
pd.Timestamp?

Init signature:
pd.Timestamp(
    ts_input=<object object at 0x000002A35B777ED0>,
    freq=None,
    tz=None,
    unit=None,
    year=None,
    month=None,
    day=None,
    hour=None,
    minute=None,
    second=None,
    microsecond=None,
    nanosecond=None,
    tzinfo=None,
    *,
    fold=None,
)
Docstring:
Pandas replacement for python datetime.datetime object.

Timestamp is the pandas equivalent of python's Datetime
and is interchangeable with it in most cases. It's the type used
for the entries that make up a DatetimeIndex, and other timeseries
oriented data structures in pandas.

Parameters
----------
ts_input : datetime-like, str, int, float
    Value to be converted to Timestamp.
freq : str, DateOffset
    Offset which Timestamp will have.
tz : str, pytz.timezone, dateutil.tz.tzfile or None
    Time zone for time which Timestamp will have.
unit : str
    Unit used for conversion if ts_input is of type int or float. The
    valid values are 'D', 'h', 'm', 's', 'ms', 'us', and 'ns'. For
    example, 's' means seconds and 'ms' means milliseconds.
year, month, day : int
hour, minute, second, microsecond : int, optional, default 0
nanosecond : int, optional, default 0
tzinfo : datetime.tzinfo, optional, default None
fold : {0, 1}, default None, keyword-only
    Due to daylight saving time, one wall clock time can occur twice
    when shifting from summer to winter time; fold describes whether the
    datetime-like corresponds  to the first (0) or the second time (1)
    the wall clock hits the ambiguous time.

    .. versionadded:: 1.1.0

Notes
-----
There are essentially three calling conventions for the constructor. The
primary form accepts four parameters. They can be passed by position or
keyword.

The other two forms mimic the parameters from ``datetime.datetime``. They
can be passed by either position or keyword, but not both mixed together.

Examples
--------
Using the primary calling convention:

This converts a datetime-like string

>>> pd.Timestamp('2017-01-01T12')
Timestamp('2017-01-01 12:00:00')

This converts a float representing a Unix epoch in units of seconds

>>> pd.Timestamp(1513393355.5, unit='s')
Timestamp('2017-12-16 03:02:35.500000')

This converts an int representing a Unix-epoch in units of seconds
and for a particular timezone

>>> pd.Timestamp(1513393355, unit='s', tz='US/Pacific')
Timestamp('2017-12-15 19:02:35-0800', tz='US/Pacific')

Using the other two forms that mimic the API for ``datetime.datetime``:

>>> pd.Timestamp(2017, 1, 1, 12)
Timestamp('2017-01-01 12:00:00')

>>> pd.Timestamp(year=2017, month=1, day=1, hour=12)
Timestamp('2017-01-01 12:00:00')
File:           c:\users\user\appdata\local\programs\python\python39\lib\site-packages\pandas\_libs\tslibs\timestamps.cp39-win_amd64.pyd
Type:           type
Subclasses:

In [3]:
data=pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
np.series?

Object `np.series` not found.

In [7]:
data=pd.Series([0.25,0.5,0.75,1.0],
              index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [8]:
data['c']

0.75

In [9]:
#Series as specialized dictionary

pop_dict={'california':38764646,
         'Texas':86464684,
         'New York':757357,
         'Florida':7347347,
         'Ohio':6486386}
population=pd.Series(pop_dict)
population

california    38764646
Texas         86464684
New York        757357
Florida        7347347
Ohio           6486386
dtype: int64

In [10]:
population['Ohio']

6486386

In [11]:
population[:'New York']

california    38764646
Texas         86464684
New York        757357
dtype: int64

In [12]:
#Pandas DataFrame object
area_dict={'california':88900,
          'Texas':67543,
          'New York':10085,
          'Florida':67948,
          'Ohio':46757}
area_dict

{'california': 88900,
 'Texas': 67543,
 'New York': 10085,
 'Florida': 67948,
 'Ohio': 46757}

In [13]:
area=pd.Series(area_dict)
area

california    88900
Texas         67543
New York      10085
Florida       67948
Ohio          46757
dtype: int64

In [14]:
states=pd.DataFrame({'Population':population,
                    'area code':area})
states

            Population  area code
california    38764646      88900
Texas         86464684      67543
New York        757357      10085
Florida        7347347      67948
Ohio           6486386      46757

In [15]:
states.index

Index(['california', 'Texas', 'New York', 'Florida', 'Ohio'], dtype='object')

In [16]:
states.columns

Index(['Population', 'area code'], dtype='object')

In [17]:
#DF as a specialized dictionary
states['area code']

california    88900
Texas         67543
New York      10085
Florida       67948
Ohio          46757
Name: area code, dtype: int64

In [18]:
#Constructing pandas DF
pd.DataFrame(population,columns=['population'])
#from a single series object

            population
california    38764646
Texas         86464684
New York        757357
Florida        7347347
Ohio           6486386

In [19]:
#froma list of dicts
data=[{'a':i,'b':2*i,'c':i*3,'d':i**2}
     for i in range(10)]
pd.DataFrame(data)

   a   b   c   d
0  0   0   0   0
1  1   2   3   1
2  2   4   6   4
3  3   6   9   9
4  4   8  12  16
5  5  10  15  25
6  6  12  18  36
7  7  14  21  49
8  8  16  24  64
9  9  18  27  81

In [20]:
pd.DataFrame([{'a':1,'b':2,'c':3},{'a':1,'c':35}])

   a    b   c
0  1  2.0   3
1  1  NaN  35

In [21]:
#from a dict of series objects
pd.DataFrame({'population':population,
             'area code':area})

            population  area code
california    38764646      88900
Texas         86464684      67543
New York        757357      10085
Florida        7347347      67948
Ohio           6486386      46757

In [22]:
#from a 2D numpy array
pd.DataFrame(np.random.rand(4,2),
            columns=['foo','bar'],
            index=['a','b','c','d'])

        foo       bar
a  0.467747  0.087602
b  0.629153  0.002277
c  0.887129  0.567875
d  0.320591  0.429479

In [23]:
#from structured array
A=np.zeros(5,dtype=[('A','i8'),('B','f8')])
A

array([(0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.)],
      dtype=[('A', '<i8'), ('B', '<f8')])

In [24]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0
3  0  0.0
4  0  0.0

In [25]:
#Index object
index=pd.Index([2,1,4,5,7])
index

Int64Index([2, 1, 4, 5, 7], dtype='int64')

In [26]:
index[::2]

Int64Index([2, 4, 7], dtype='int64')

In [27]:
index[:2]

Int64Index([2, 1], dtype='int64')

print(index.size,index.shape,index.ndim,index.dtype)

In [28]:
index[2]=0

TypeError: Index does not support mutable operations

In [ ]:
#Index as ordered set
indA=pd.Index([8,9,5,4,2,1])
indB=pd.Index([0,3,1,6,7,9])
indA&indB#intersection

In [ ]:
indA|indB#union

In [ ]:
indA^indB#symetric difference

In [ ]:
indA.union(indB)

In [ ]:
#Data selection in series
data=pd.Series([0.25,0.5,0.75,1.0],
              index=['a','b','c','d'])

In [ ]:
data

In [ ]:
data['c']

In [ ]:
'a'in data

In [ ]:
'f'in data

In [ ]:
data.keys()

In [ ]:
data.values()

In [ ]:
data['e']=1.25

In [ ]:
data

In [ ]:
#series as a 1D array
data['a':'c']#slicing by explicit index

In [ ]:
data[0:2]#slicing y implicit integer index

In [ ]:
data[(data>0.3)&(data<1.0)]#masking

In [ ]:
data[['a','e']]#fancy indexing

In [ ]:
data.loc['a']

In [ ]:
data.loc['a':'c']

In [ ]:
area_dict

In [ ]:
#Data selectin in DataFrame>>>DataFrame as a dictionary

area=data[area_dict]
area

In [ ]:
area_dict

In [ ]:
population

In [ ]:
data.population

In [ ]:
area=area_dict
area
pop=population
pop

In [ ]:
data=pd.DataFrame({'area':area,'pop':pop})
data

In [ ]:
data.area

In [ ]:
data['area']

In [ ]:
data.area is data['area']

In [ ]:
data.pop is data['area']

In [ ]:
data['density']=data['pop']/data['area']
data

In [ ]:
data.drop['density per km**2']
data

In [ ]:
data.drop[['density per km**2'],axis = 0]

In [ ]:
data.values#DataFrame as 2D array

In [ ]:
data.T

In [ ]:
data['area']

In [ ]:
data.loc[data.density>100,['pop','density']]

In [ ]:
data.iloc[0,2]=90
data

In [ ]:
#Operating on data in Pandas
#ufuncs:index preservation
rng=np.random.RandomState(42)
ser=pd.Series(rng.randint(0,100,4))
ser

In [ ]:
df=pd.DataFrame(rng.randint(0,10,(3,4)),
               columns=['A','B','C','D'])
df

In [ ]:
np.exp(ser)

In [ ]:
np.sin(df*np.pi/4)

In [ ]:
#Ufuncs:Index Alignment
area=pd.Series({"Murang'a":21000,'Nairobi':47000,'Mombasa':10000,'Nyeri':18009},
              name='area')
population =pd.Series({'Nairobi':4863678,"Murang'a":587348,'Nyeri':809488,'Siaya':389456},
                     name='population')

In [ ]:
density=population/area
density

In [ ]:
area.index|population.index

In [ ]:
A=pd.Series([2,3,4], index=[0,1,2])
B=pd.Series([4,5,6], index=[1,2,3])
A+B

In [ ]:
A.add(B,fill_value=0)

In [ ]:
#index alignment in dataframes
C=pd.DataFrame(rng.randint(0,20,(2,2)),
           columns=list ('CD'))
C

In [ ]:
D=pd.DataFrame(rng.randint(0,10,(3,3)),
              columns=list('CDE'))
D

In [ ]:
C+D

In [ ]:
fill=C.stack().mean()
C.add(D,fill_value=fill)

In [ ]:
#Ops between dataframes and series
A=rng.randint(10,size=(3,4))
A

In [ ]:
A-A[0]

In [ ]:
df=pd.DataFrame(A,columns=list('QRSTdf-df.iloc[0]

In [ ]:
df.subtract(df['R'], axis=0)

In [ ]:
halfrow=df.iloc[0,::2]
halfrow

In [ ]:
df-halfrow

In [ ]:
#Handling missing data
vals1=np.array([1,None,3,4])
vals1

array([1, None, 3, 4], dtype=object)

In [ ]:
for dtype in ['object','int']:
    print("dtype= ",dtype)
    %timeit np.arange(1E6,dtype=dtype).sum()
    print()

dtype=  object
76 ms ± 948 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype=  int
2.51 ms ± 41.3 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [ ]:
vals1.mean()#expected error

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [ ]:
vals2=np.array([1,np.nan,3,4])
vals2.dtype

dtype('float64')

In [ ]:
1+np.nan

nan

In [ ]:
0*np.nan

nan

In [ ]:
vals2.sum()

nan

In [ ]:
vals2.min(),vals2.max()

(nan, nan)

In [ ]:
np.nansum(vals2),np.nanmin(vals2),np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [ ]:
np.nanmean(vals2)

2.6666666666666665

In [ ]:
#NaN and None in Pandas
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [ ]:
x=pd.Series(range(4),dtype=int)
x

0    0
1    1
2    2
3    3
dtype: int32

In [ ]:
x[0]=None
x

0    NaN
1    1.0
2    2.0
3    3.0
dtype: float64

In [ ]:
#Operation on null values
data=pd.Series([1,np.nan,'helloo ',None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [ ]:
data[data.notnull()]

0          1
2    helloo
dtype: object

In [ ]:
data.dropna()

0          1
2    helloo
dtype: object

In [ ]:
df=pd.DataFrame([[1,np.nan,2],
               [2,3,None],
               [5,4,6],
               [9,np.nan,None]])
df

   0    1    2
0  1  NaN  2.0
1  2  3.0  NaN
2  5  4.0  6.0
3  9  NaN  NaN

In [ ]:
df.dropna()

   0    1    2
2  5  4.0  6.0

In [ ]:
df.dropna(axis='columns')

   0
0  1
1  2
2  5
3  9

In [ ]:
df[3]=np.nan
df

   0    1    2   3
0  1  NaN  2.0 NaN
1  2  3.0  NaN NaN
2  5  4.0  6.0 NaN
3  9  NaN  NaN NaN

In [ ]:
df.dropna(axis='columns',how='all')

   0    1    2
0  1  NaN  2.0
1  2  3.0  NaN
2  5  4.0  6.0
3  9  NaN  NaN

In [ ]:
df.dropna(axis='rows',thresh=3)

   0    1    2   3
2  5  4.0  6.0 NaN

In [ ]:
#filling null values
data=pd.Series([1,np.nan,2,None,3],index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [ ]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [ ]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [ ]:
data.fillna(method ='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [ ]:
df

   0    1    2   3
0  1  NaN  2.0 NaN
1  2  3.0  NaN NaN
2  5  4.0  6.0 NaN
3  9  NaN  NaN NaN

In [ ]:
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  3.0  3.0
2  5.0  4.0  6.0  6.0
3  9.0  9.0  9.0  9.0